app/controllers/api/v1/repairorders_controller.rb

  def index
    repairorders = Repairorder.all
---
SELECT "repairorders".* FROM "repairorders"

  def show
    repairorder = Repairorder.find(params[:id])
---
SELECT  "repairorders".* FROM "repairorders" WHERE "repairorders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    repairorder = Repairorder.new(repairorder_params)
    if repairorder.save
---
INSERT INTO "repairorders" ("body_hours", "paint_hours", "reassembly_hours", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body_hours", 1.2], ["paint_hours", 3.6], ["reassembly_hours", 9.8], ["created_at", "2017-12-22 16:51:43.755505"], ["updated_at", "2017-12-22 16:51:43.755505"]]