app/controllers/api/v1/technicians_controller.rb

  def index
    technicians = Technician.all
---
SELECT "technicians".* FROM "technicians"

  def show
    technician = Technician.find(params[:id])
---
SELECT  "technicians".* FROM "technicians" WHERE "technicians"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    technician = Technician.new(technician_params)
    if technician.save
---
INSERT INTO "technicians" ("first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "Jason"], ["last_name", "Jones"], ["created_at", "2017-12-20 23:27:08.549425"], ["updated_at", "2017-12-20 23:27:08.549425"]]