app/controllers/api/v1/vehicles_controller.rb

SELECT "vehicles".* FROM "vehicles"
---
  def index
    vehicles = Vehicle.all

SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    vehicle = Vehicle.find(params[:id])

INSERT INTO "vehicles" ("model_year", "vehicle_make", "vehicle_model", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["model_year", "1997"], ["vehicle_make", "Ford"], ["vehicle_model", "F150"], ["created_at", "2017-12-19 20:41:05.871728"], ["updated_at", "2017-12-19 20:41:05.871728"]]
---
  def create
    vehicle = Vehicle.new(vehicle_params)
    if vehicle.save